In [1]:
import numpy as np
import pandas as pd

In [2]:
df=pd.read_csv("C:\\Users\\KIIT\\Documents\\Python Scripts\\Module case study\\539_m4_datasets_v1.0\\bank-data.csv")
print(df.shape)
df

(447, 4)

     age            job  marital    y
0     20        student   single  yes
1     32     management   single  yes
2     49     technician  married  yes
3     32    blue-collar  married  yes
4     33     management  married  yes
..   ...            ...      ...  ...
442   26     technician   single  yes
443   60  self-employed  married  yes
444   42    blue-collar   single  yes
445   32         admin.   single  yes
446   46    blue-collar  married  yes

[447 rows x 4 columns]

In [3]:
df1=pd.read_csv("C:\\Users\\KIIT\\Documents\\Python Scripts\\Module case study\\539_m4_datasets_v1.0\\FairDealCustomerData.csv")
print(df1.shape)
df1

(532, 3)

            Add                   Name  Eligibility
0        Braund       Mr. Owen Harris             1
1     Heikkinen           Miss. Laina             0
2         Allen     Mr. William Henry             0
3         Moran             Mr. James             0
4      McCarthy         Mr. Timothy J             0
..          ...                    ...          ...
527    Banfield   Mr. Frederick James             0
528    Sutehall          Mr. Henry Jr             0
529    Montvila           Rev. Juozas             0
530        Behr       Mr. Karl Howell             0
531      Dooley           Mr. Patrick             0

[532 rows x 3 columns]

In [4]:
my_set = set(df.job)
my_set

{'admin.',
 'blue-collar',
 'entrepreneur',
 'housemaid',
 'management',
 'self-employed',
 'services',
 'student',
 'technician'}

In [9]:
a=input("Enter the profession : ")
if a in my_set:
    print("yes")
    b= input("Enter the name of client :")
    if b in df1[['Name']]:
        print("Eligible")
else:
    print("Not Eligible")

Enter the profession : student
yes
Enter the name of client :Mr. Owen Harris